[33m3574ea1[m[33m ([m[1;36mHEAD[m[33m -> [m[1;32mmain[m[33m, [m[1;31morigin/main[m[33m, [m[1;31morigin/HEAD[m[33m)[m README完成
[33m859cefa[m Merge pull request #5 from c0b23013f7/main
[33mb7eadff[m ルール説明追加
[33mc5d588f[m 更新
[33m046c47b[m Merge pull request #4 from c0b23013f7/main
[33me9ee2b8[m カウントダウンします
[33m60b8227[m Merge branch 'C0B23013/countdown'
[33m409ab2e[m Merge pull request #3 from c0a2301549/main
[33m4d61766[m 背景の追加
[33me5dfc5b[m BGM追加完３
[33m4969e18[m BGM追加完２
[33m04690b5[m Merge pull request #2 from c0b23109f0/main
[33meed888c[m コンフリクト解消（長島）
[33md6f5515[m 背景のinitの説明の追加
[33m1f76b9d[m BGM追加完
[33m45b5d7a[m 背景の生成方法を変更
[33m4eaacba[m BGM追加
[33m60d9c12[m Merge branch 'C0B23061/Significant'
[33m2890975[m 画像追加
[33mef5c660[m 最終変更
[33m82e02e1[m README追加
[33m427ab37[m[33m ([m[1;32mC0B23061/Significant[m[33m)[m 各判定完成1
[33mbf572fa[m[33m ([m[1;31morigin/C0B23061/Significant[m[33m)[m 各判定完成
[33md3ff0e8[m 各判定
[33mc1448d7[m リスタート時の問題解消
[33m3637d9e[m 敵画像変更
[33m3b7af77[m 途中：判定
[33m8ef60c5[m xp獲得と敵hp設定
[33mb0cfd12[m 途中
[33mc482a75[m 途中：敵の被弾判定
[33mdec0fae[m 敵の数変更
[33meda5d6a[m 敵の弾判定&リスタート
[33m4e48c4b[m レベル処理とオート攻撃
[33ma24c086[m ルール説明作成
[33me37f3c6[m カウントダウン作成
[33md398eb7[m 背景の表示
[33m050b084[m 敵の実装（続き）
[33mae02875[m 敵の画像切替前
[33ma3a70fb[m fig:画像追加
[33mbc70c75[m fig画像
[33m719f245[m 初期状態：共通基本機能
[33m579f772[m 初期README
[33m58bc98a[m README
